# Taps
tap 'homebrew/cask'
tap 'homebrew/cask-fonts'
tap 'homebrew/cask-versions'
tap 'homebrew/bundle'

# Binaries
# brew 'awscli'
# brew 'bash' # Latest Bash version
# brew 'coreutils' # Those that come with macOS are outdated
# brew 'ffmpeg'
# brew 'go'
# brew 'gh'
# brew 'git'
# brew 'gnupg2'
# brew 'grep'
# brew 'httpie'
# brew 'hub'
# brew 'mackup'
# brew 'mas' # Mac App Store manager
# brew 'pkg-config' # https://github.com/driesvints/dotfiles/issues/20s
# brew 'svn'
# brew 'trash' # Manage the Trash bin
# brew 'tree' # List directories in a tree structure
# brew 'zlib' # Needed for Memcached

# # Development
# brew 'ctags'
# brew 'macvim'
# brew php 7.4 8 nginx

# Apps
cask '1password'
cask '1password-cli'
cask 'alfred'
cask 'cyberduck'
cask 'discord'
cask 'docker'
cask 'figma'
cask 'firefox'
cask 'google-chrome'
cask 'iterm2'
cask 'nordvpn'
cask 'ngrok'
cask 'notion'
cask 'moom'
cask 'phpstorm'
cask 'slack'
cask 'sublime-text'
cask 'tableplus'
cask 'the-unarchiver'
cask 'tinkerwell'
cask 'transmission'
cask 'vagrant'
cask 'virtualbox'
cask 'visual-studio-code'
cask 'vlc'

## Install ray, sip, google drive, flux, 
