# Taps
tap 'homebrew/brew'
tap 'shivammathur/php'
tap 'nicoverbruggen/homebrew-cask'

# Binaries
brew 'awscli'
brew 'bash' # Latest Bash version
brew 'blueutil'
brew 'coreutils' # Those that come with macOS are outdated
# brew 'ffmpeg'
# brew 'go'
# brew 'gh'
brew 'git'
# brew 'gnupg2'
# brew 'grep'
# brew 'httpie'
# brew 'hub'
# brew 'mackup'
# brew 'mas' # Mac App Store manager
# brew 'pkg-config' # https://github.com/driesvints/dotfiles/issues/20s
# brew 'svn'
brew 'trash' # Manage the Trash bin https://hasseg.org/trash/
brew 'tree' # List directories in a tree structure
# brew 'zlib' # Needed for Memcached

# Development
brew 'shivammathur/php/php@8.3'
brew 'shivammathur/php/php@7.4'
brew 'composer'
# brew 'imagemagick'
# brew 'libmemcached'
# brew 'memcached'
# brew 'mysql'
# brew 'nginx'
brew 'node'
brew 'yarn'
brew 'neovim

# Apps
#cask '1password'
cask 'bruno'
cask '1password-cli'
cask 'alfred'
cask 'cleanshot'
cask 'commander-one'
cask 'bartender'
cask 'cyberduck'
cask 'discord'
cask 'docker'
#cask 'firefox'
cask 'flux'
cask 'kitty'
cask 'nordvpn'
cask 'notion'
cask 'moom'
cask 'phpmon'
cask 'phpstorm'
#cask 'slack'
#cask 'sublime-text'
#cask 'tableplus'
#cash 'dbeng'
#cask 'the-unarchiver'
cask 'tinkerwell'
cask 'transmission'
#cask 'visual-studio-code'
#cask 'notion-calendar'

## Manual
## Hey Mail
## Google Drive
## Zoom
## Ray - Spatie
## sip
