# Taps
tap 'homebrew/cask'
tap 'homebrew/cask-fonts'
tap 'homebrew/cask-versions'
tap 'homebrew/bundle'
tap 'shivammathur/php'

# Binaries
brew 'awscli'
brew 'bash' # Latest Bash version
brew 'blueutil'
brew 'coreutils' # Those that come with macOS are outdated
# brew 'ffmpeg'
brew 'go'
# brew 'gh'
brew 'git'
# brew 'gnupg2'
# brew 'grep'
# brew 'httpie'
# brew 'hub'
brew 'mackup'
# brew 'mas' # Mac App Store manager
# brew 'pkg-config' # https://github.com/driesvints/dotfiles/issues/20s
# brew 'svn'
# brew 'trash' # Manage the Trash bin
# brew 'tree' # List directories in a tree structure
# brew 'zlib' # Needed for Memcached

# Development
brew 'shivammathur/php/php@8.0'
brew 'shivammathur/php/php@7.4'
brew 'composer'
# brew 'imagemagick'
# brew 'libmemcached'
# brew 'memcached'
# brew 'mysql'
brew 'nginx'
brew 'node'
brew 'yarn'

# Apps
cask '1password'
cask '1password-cli'
cask 'alfred'
cask 'cyberduck'
cask 'discord'
cask 'docker'
cask 'figma'
cask 'firefox'
cask 'flux'
cask 'google-chrome'
cask 'hyper'
cask 'iterm2'
cask 'nordvpn'
cask 'notion'
cask 'moom'
cask 'phpstorm'
cask 'slack'
cask 'sublime-text'
cask 'tableplus'
cask 'the-unarchiver'
cask 'tinkerwell'
cask 'transmission'
cask 'visual-studio-code'
cask 'vlc'

## Manual
## Hey Mail
## Google Drive
## Zoom
## Ray - Spatie
## sip
